======================================================================================================================
DESCRIPTION:

MB-52784: Use PrivilegeMask for PrivilegeContext::droppedPrivileges

Instead of a std::vector. This saves at least 16 bytes per
PrivilegeContext instance, more if droppedPrivileges actually used as
we replace a 24B vector (plus whatever heap alloc it uses when
non-empty) for an 8B bitset:

Before:

    /*  392      |    56 */    class cb::rbac::PrivilegeContext {
				 protected:
    /*  392      |     4 */        uint32_t generation;
    /*  396      |     1 */        cb::rbac::Domain domain;
    /* XXX  3-byte hole  */
    /*  400      |     8 */        cb::rbac::PrivilegeMask mask;
    /*  408      |    16 */        class std::shared_ptr<cb::rbac::Bucket const> [with _Tp = const cb::rbac::Bucket] : public std::__shared_ptr<_Tp const, (__gnu_cxx::_Lock_policy)2> {

				       /* total size (bytes):   16 */
				   } bucket;
    /*  424      |    24 */        class std::vector<cb::rbac::Privilege, std::allocator<cb::rbac::Privilege> > [with _Tp = cb::rbac::Privilege, _Alloc = std::allocator<cb::rbac::Privilege>] : protected std::_Vector_base<_Tp, _Alloc> {

				       /* total size (bytes):   24 */
				   } droppedPrivileges;

				   /* total size (bytes):   56 */
			       } privilegeContext;

After:

    /*  392      |    40 */    class cb::rbac::PrivilegeContext {
				 protected:
    /*  392      |     4 */        uint32_t generation;
    /*  396      |     1 */        cb::rbac::Domain domain;
    /* XXX  3-byte hole  */
    /*  400      |     8 */        cb::rbac::PrivilegeMask mask;
    /*  408      |    16 */        class std::shared_ptr<cb::rbac::Bucket const> [with _Tp = const cb::rbac::Bucket] : public std::__shared_ptr<_Tp const, (__gnu_cxx::_Lock_policy)2> {

				       /* total size (bytes):   16 */
				   } bucket;
    /*  424      |     8 */        cb::rbac::PrivilegeMask droppedPrivileges;

				   /* total size (bytes):   40 */
			       } privilegeContext;

Has the knock-on effect of reducing the size of Cookie from 608 to 576
Bytes.

Change-Id: If6dfd6678bd8f44a72df2cd0d45058dbbf39b844
Reviewed-on: https://review.couchbase.org/c/kv_engine/+/176807
Reviewed-by: Trond Norbye <trond.norbye@couchbase.com>
Tested-by: Build Bot <build@couchbase.com>

======================================================================================================================
COMMENTS
======================================================================================================================
Author: Trond Norbye
Date: 2022-06-28 17:56:15.000000000
Message: 
Change has been successfully cherry-picked as 77483c179e5399dd2724d9c220480410cf60e909

1 is the latest approved patch-set.
No files were changed between the latest approved patch-set and the submitted one.

----------------------------------------------------------------------------------------------------------------------
Author: Build Bot
Date: 2022-06-28 17:56:21.000000000
Message: 
Patch Set 3:

Build Started http://cv.jenkins.couchbase.com/job/kv_engine-post-commit-TSan-master/7525/ (1/2)
----------------------------------------------------------------------------------------------------------------------
Author: Build Bot
Date: 2022-06-28 18:29:18.000000000
Message: 
Patch Set 3:

Build Started http://cv.jenkins.couchbase.com/job/kv_engine-post-commit-master/11485/ (2/2)
----------------------------------------------------------------------------------------------------------------------
Author: Build Bot
Date: 2022-06-28 19:01:55.000000000
Message: 
Patch Set 3:

Build Unstable 

http://cv.jenkins.couchbase.com/job/kv_engine-post-commit-master/11485/ : UNSTABLE

ERROR: suite_setUp (unittest.loader._FailedTest)
 ( http://cv.jenkins.couchbase.com/job/kv_engine-post-commit-master/11485/ )

Failure of a testrunner test ( http://cv.jenkins.couchbase.com/job/kv_engine-post-commit-master/11485/ )

http://cv.jenkins.couchbase.com/job/kv_engine-post-commit-TSan-master/7525/ : SUCCESS
----------------------------------------------------------------------------------------------------------------------
