======================================================================================================================
DESCRIPTION:

Use PrivilegeMask for PrivilegeContext::droppedPrivileges

Instead of a std::vector. This saves at least 16 bytes per
PrivilegeContext instance, more if droppedPrivileges actually used as
we replace a 24B vector (plus whatever heap alloc it uses when
non-empty) for an 8B bitset:

Before:

    /*  392      |    56 */    class cb::rbac::PrivilegeContext {
				 protected:
    /*  392      |     4 */        uint32_t generation;
    /*  396      |     1 */        cb::rbac::Domain domain;
    /* XXX  3-byte hole  */
    /*  400      |     8 */        cb::rbac::PrivilegeMask mask;
    /*  408      |    16 */        class std::shared_ptr<cb::rbac::Bucket const> [with _Tp = const cb::rbac::Bucket] : public std::__shared_ptr<_Tp const, (__gnu_cxx::_Lock_policy)2> {

				       /* total size (bytes):   16 */
				   } bucket;
    /*  424      |    24 */        class std::vector<cb::rbac::Privilege, std::allocator<cb::rbac::Privilege> > [with _Tp = cb::rbac::Privilege, _Alloc = std::allocator<cb::rbac::Privilege>] : protected std::_Vector_base<_Tp, _Alloc> {

				       /* total size (bytes):   24 */
				   } droppedPrivileges;

				   /* total size (bytes):   56 */
			       } privilegeContext;

After:

    /*  392      |    40 */    class cb::rbac::PrivilegeContext {
				 protected:
    /*  392      |     4 */        uint32_t generation;
    /*  396      |     1 */        cb::rbac::Domain domain;
    /* XXX  3-byte hole  */
    /*  400      |     8 */        cb::rbac::PrivilegeMask mask;
    /*  408      |    16 */        class std::shared_ptr<cb::rbac::Bucket const> [with _Tp = const cb::rbac::Bucket] : public std::__shared_ptr<_Tp const, (__gnu_cxx::_Lock_policy)2> {

				       /* total size (bytes):   16 */
				   } bucket;
    /*  424      |     8 */        cb::rbac::PrivilegeMask droppedPrivileges;

				   /* total size (bytes):   40 */
			       } privilegeContext;

Has the knock-on effect of reducing the size of Cookie from 608 to 576
Bytes.

Change-Id: If6dfd6678bd8f44a72df2cd0d45058dbbf39b844

======================================================================================================================
COMMENTS
======================================================================================================================
Author: Dave Rigby
Date: 2022-06-28 12:55:45.000000000
Message: 
Uploaded patch set 1.
----------------------------------------------------------------------------------------------------------------------
Author: Trond Norbye
Date: 2022-06-28 13:00:18.000000000
Message: 
Patch Set 1: Code-Review+2
----------------------------------------------------------------------------------------------------------------------
Author: Build Bot
Date: 2022-06-28 13:36:27.000000000
Message: 
Patch Set 1: Verified-1

Build Failed 

http://cv.jenkins.couchbase.com/job/kv_engine.ASan-UBSan/job/master/28630/ : FAILURE

No problems were identified. If you know why this problem occurred, please add a suitable Cause for it. ( http://cv.jenkins.couchbase.com/job/kv_engine.ASan-UBSan/job/master/28630/ )

http://cv.jenkins.couchbase.com/job/kv_engine-clang_format_9/17519/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine-windows-master/47129/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine-clang_tidy-master/18372/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine-clang_analyzer-master/39589/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.aarch64-linux/job/master/8143/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.libFuzzer/job/master/8043/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.linux/job/master/20597/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.macos/job/master/19465/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.linux-CE/job/master/20249/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.threadsanitizer/job/master/21241/ : SUCCESS
----------------------------------------------------------------------------------------------------------------------
Author: Build Bot
Date: 2022-06-28 15:17:37.000000000
Message: 
Patch Set 1: Verified+1

Build Successful 

http://cv.jenkins.couchbase.com/job/kv_engine-clang_format_9/17519/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine-windows-master/47129/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine-clang_tidy-master/18372/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine-clang_analyzer-master/39589/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.aarch64-linux/job/master/8143/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.libFuzzer/job/master/8043/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.linux/job/master/20597/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.macos/job/master/19465/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.linux-CE/job/master/20249/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.threadsanitizer/job/master/21241/ : SUCCESS

http://cv.jenkins.couchbase.com/job/kv_engine.ASan-UBSan/job/master/28645/ : SUCCESS
----------------------------------------------------------------------------------------------------------------------
